fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.BKM_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = Параметры.АдресВХранилище;
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Для каждого Строка из ОтпускаСотрудников Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Текст = Строка.Сотрудник;
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
		CтрокаТаблицы = Объект.ОтпускаСотрудников.Добавить();
		CтрокаТаблицы.Сотрудник = Строка.Сотрудник;
		CтрокаТаблицы.ДатаНачала = Строка.ДатаНачала;
		CтрокаТаблицы.ДатаОкончания = Строка.ДатаОкончания;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
